Revit 2026 API

# OptionalFunctionalityUtilsIsIFCAvailable Method

---

Checks whether IFC functionality is available in the installed Revit.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static bool IsIFCAvailable()
```
```vb
Public Shared Function IsIFCAvailable As Boolean
```
```cpp
public:
static bool IsIFCAvailable()
```
```fsharp
static member IsIFCAvailable : unit -> bool
```

#### Return Value

Boolean True if the IFC functionality is available in the installed Revit.

IFC Import/Export requires presence of certain modules that are optional and may not be part of the installed Revit.

#### Reference

OptionalFunctionalityUtils Class

Autodesk.Revit.DB Namespace